'''Автоматическая документация по API'''

'''Интерактивная документация Swagger
Для просмотра интерактивной документации Swagger нужно запустить приложение
и перейти по адресу http://localhost:8000/docs. На странице будут представлены все
маршруты и параметры, доступные в приложении.

Также Swagger UI позволяет отправлять запросы к API прямо из интерфейса. Для
этого нужно выбрать метод запроса и заполнить параметры запроса, если таковые
имеются. После отправки запроса будет отображен его результат.

'''

'''Альтернативная документация ReDoc
ReDoc — это альтернативный инструмент для документирования API, который
также поддерживается FastAPI. Он предоставляет более простой и лаконичный
интерфейс для просмотра документации.

Для просмотра документации ReDoc нужно запустить приложение и перейти по
адресу http://localhost:8000/redoc. На странице будет отображена документация API
в формате OpenAPI.

ReDoc не позволяет отправлять запросы к API из интерфейса.
'''